rule suspicious_application_added_as_startup_app {

  meta:
    author = "max-h471"
    description = "This alert will detect when an application is added as a startup app. Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in."
    severity = "Low"
    mitre_attack_tactic = "Suspicious Application Added as Startup App"
    mitre_attack_technique_id = "T1547"
    mitre_attack_technique = "Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder"


  events:
    // Modify Defender or Windows event log as they are named in your environment
    ($e.metadata.log_type = "MICROSOFT_DEFENDER_ENDPOINT" or $e.metadata.log_type = "Windows_Event_Log")
    // 4698 = sched task created, 4700 = sched task enabled, 4702 = sched task updated
    (
    $e.metadata.product_event_type = "DeviceRegistryEvents" or $e.metadata.product_event_type = /4698/ or $e.metadata.log_type = /4700/ or $e.metadata.log_type = /4702/ or 
    $e.target.process.command_line = /schtasks/ or $e.metadata.event_type = "PROCESS_LAUNCH" or $e.metadata.event_type = "REGISTRY_CREATION"
    )

    // These are the registry keys that get edited when an app adds itself to run on startup
    (
    $e.target.registry.registry_key = /HKEY_(LOCAL_MACHINE|CURRENT_USER)\\Software\\Microsoft\\Windows(NT)?\\CurrentVersion\\(load|Run(Once)?)/ nocase or 
    $e.target.registry.registry_key = /HKEY_(LOCAL_MACHINE|CURRENT_USER)\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Run(Once)?/ nocase or 
    $e.target.registry.registry_key = /HKEY_(LOCAL_MACHINE|CURRENT_USER)\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run(Once)?/ nocase or 
    $e.target.registry.registry_key = /HKEY_(LOCAL_MACHINE|CURRENT_USER)\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run/ nocase or
    $e.target.registry.registry_key = /HKEY_(LOCAL_MACHINE|CURRENT_USER)\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Schedule\\TaskCache\\Tree/ nocase or
    $e.target.registry.registry_key = /HKEY_(LOCAL_MACHINE|CURRENT_USER)\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\StartupApproved\\Run/ or
    // file paths for startup apps on any mounted Drive letter that would be added to for startup apps
    $e.target.file.full_path = /([A-Z]):\\Users\\(.+)\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup/ nocase or 
    $e.target.file.full_path = /([A-Z]):\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp/ nocase 
    )
    
  outcome:
    $risk_score = 40
    $mitre_attack_tactic = "Suspicious Application Added as Startup App"
    $mitre_attack_technique = "Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder"
    $mitre_attack_technique_id = "T1547.001"

  condition:
    $e
