DeviceNetworkEvents
| where Timestamp between (datetime(2025-01-20 00:00:00)..datetime(2025-02-04 00:00:00)) 
| where ActionType == “ListeningConnectionCreated”
| where LocalPort <5000 //Remove open TCP ports
| where LocalIP !=”127.0.0.1”
| summarize TotalOpenPorts =dcount(LocalPort), OpenPortsList = make_set(LocalPort) by DeviceId
| sort by TotalOpenPorts
