let databaseports = dynamic([1433, 1434, 1583, 3050, 3306, 3351, 5432]);
DeviceNetworkEvents
| where Timestamp between (datetime(2025-01-20 00:00:00)..datetime(2025-02-04 00:00:00))
| where ActionType == “ListeningConnectionCreated”
| where LocalPort in (databaseports)
| summarize OpenPorts = make_set(LocalPort), TotalOpenDatabasePorts = dcount(LocalPort) by 
DeviceId
| sort by TotalOpenDatabasePorts
