// IdentityLogonEvents is from Defender for Identity, so this is on Prem
//remove AccountObjectID listing to look overall and add it bad to choose a specific account or accounts
IdentityLogonEvents 
| where TimeGenerated  between (datetime(2025-06-20 00:00:00)..datetime(2025-06-27 23:00:00))
| where isnotempty(AccountObjectId)
| where ActionType == "LogonFailed"
| summarize count() by TimeGenerated, ActionType, AccountUpn, FailureReason, Protocol, IPAddress, DeviceName, DestinationDeviceName
